Revit 2027 API
SaveAsOptions.GetWorksharingOptions Method
 Gets Worksharing options for SaveAs.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public WorksharingSaveAsOptions GetWorksharingOptions()
Public Function GetWorksharingOptions As WorksharingSaveAsOptions
public:
WorksharingSaveAsOptions^ GetWorksharingOptions()
member GetWorksharingOptions : unit -> WorksharingSaveAsOptions
Return Value
WorksharingSaveAsOptions
 Defaults to null. For a workshared model, if null default values for WorksharingSaveAsOptions are used.
See Also
Reference
SaveAsOptions Class
Autodesk.Revit.DB Namespace